计算机

计算机(computer，电脑)--高速计算(数值、逻辑)，存储记忆()。按照程序运行，自动、高速处理海量数据。
组成()-- 硬件和软件系统
分类()--用途(超级、工业控制、网络、个人、嵌入式)，未来(生物、光子、量子计算机)
硬件组成()--输入输出、中央处理(算术逻辑、控制单元)、记忆单元
	电源--供电设备
	主板--电脑中各部件的工作平台
	中央处理器-CPU--运算和控制核心--功能(解释计算机指令、处理软件中数据)--构成(由运算器、控制器、寄存器、高速缓存、 总线（实现它们之间联系的数据、控制及状态）)
	记忆单元
		内存-内部存储器或者是随机存储器（RAM），组成(电路板、芯片)，特点(电子式存储，体积小，传输快，有电可存，无电清空)
		外存-外部存储器--硬盘(特点(磁片记忆，容量大，不丢失，传输较快))--辅存(u盘，光盘，网)
	输入输出
		内设
			声卡--多媒体--将电脑中的声音数字信号转换成模拟信号送到音箱上发出声音
			显卡--多媒体--人机对话--与显示器配合输出图形、文字
			网卡--连接 Internet 桥梁--功能(传输介质的接口，实现与局域网传输介质之间的物理连接和电信号匹配，帧的发送与接收、封装与拆封，介质访问控制，数据的编码与解码、缓存)
			调制解调器-猫, Modem--类型(内置式和外置式，有线式和无线式) --作用(是将电脑上处理的数字信号转换成电话线传输的模拟信号)	
		外设
			输入设备
				键盘-Keyboard
				鼠标-Mouse
			输出设备
			 	显示器-monitor
				音箱-Loud speaker
				打印机-Printer
				视频设备-摄像头、扫描仪、数码相机、数码摄像机、电视卡等设备，用于处理视频信号。
软件系统()-程序--用途(方便使用计算机，提高使用效率，用于开发、使用和维护)--分类(系统软件和应用软件)
	系统软件()-用户与计算机的接口--控制计算机系统并管理其资源-辅助用户使用--功能(启动计算机，存储、加载和执行应用程序，对文件进行排序、检索，将程序语言翻译成机器语言等)
		操作系统(Operating System，OS)-管理、控制和监督计算机软、硬件资源协调运行的程序系统，直接运行在计算机硬件上
			五大功能模块：
			（1）处理器管理：多个程序同时运行时，解决处理器（CPU）时间的分配问题。
			（2）作业管理：作业(完成某个独立任务的程序及所需的数据)。提供一个使用计算机的界面, 方便运行自己的作业，并对所有作业进行调度和控制，高效利用系统资源
			（3）存储器管理：为各个程序及其使用的数据分配存储空间，并保证它们互不干扰。
			（4）设备管理：根据用户提出使用设备的请求进行设备分配，同时还能随时接收设备的请求（称为中断），如要求输入信息。
			（5）文件管理：负责文件的存储、检索、共享和保护，方便用户操作文件
			分类(Windows, Linux, mac) Linux是一个源码公开的操作系统，程序员可以根据自己的兴趣和灵感对其进行改变，Windows和Mac不开源
		语言处理系统(翻译程序)--对源程序进行解释和编译
			
			计算机语言或称程序设计语言(人和计算机交流信息的语言)--分类(机器、汇编和高级语言)。运行高级语言程序必须配备 翻译程序(本身是一组程序)--翻译方法(解释, 编译)
		服务程序()--提供常用的服务性功能，方便用户开发程序和使用计算机，如诊断程序、调试程序、编辑程序均属此类。
		数据库系统()--由数据库（DB）、数据库管理系统（DBMS）以及相应的应用程序组成。
			
			数据库管理系统(Data Base Management System，DBMS)--数据加工、管理
	应用软件()--为解决各类实际问题而设计的程序系统--分类(服务对象分-通用软件和专用软件)--特点(运算速度快, 计算精确度高, 逻辑运算能力强, 自动化程度高, 性价比高)	

		应用(信息管理, 过程控制, 辅助技术)
发展趋势(巨型化，微型化，网络化，人工智能化，多媒体化，技术结合)
未来
	分子
		分子计算机体积小、耗电少、运算快、存储量大。分子计算机的运行是吸收分子晶体上以电荷形式存在的信息，并以更有效的方式进行组织排列。分子计算机的运算过程
		就是蛋白质分子与周围物理化学介质的相互作用过程。转换开关为酶，而程序则在酶合成系统本身和蛋白质的结构中极其明显地表示出来。生物分子组成的计算机具备能在
		生化环境下，甚至在生物有机体中运行，并能以其它分子形式与外部环境交换。因此它将在医疗诊治、遗传追踪和仿生工程中发挥无法替代的作用。分子芯片体积大大减小，
		而效率大大提高， 分子计算机完成一项运算，所需的时间仅为10微微秒，比人的思维速度快100万倍。分子计算机具有惊人的存贮容量，1立方米的DNA溶液可存储1万亿亿
		的二进制数据。分子计算机消耗的能量非常小，只有电子计算机的十亿分之一。由于分子芯片的原材料是蛋白质分子，所以分子计算机既有自我修复的功能，又可直接与分子
		活体相联。
	量子型
		量子计算机是利用原子所具有的量子特性进行信息处理的一种全新概念的计算机。量子理论认为，非相互作用下，原子在任一时刻都处于两种状态，称之为量子超态。原子
		会旋转，即同时沿上、下两个方向自旋，这正好与电子计算机0与1完全吻合。如果把一群原子聚在一起，它们不会像电子计算机那样进行的线性运算，而是同时进行所有
		可能的运算，例如量子计算机处理数据时不是分步进行而是同时完成。只要40个原子一起计算，就相当于今天一台超级计算机的性能。量子计算机以处于量子状态的原子作为
		中央处理器和内存，其运算速度可能比奔腾4芯片快10亿倍，就像一枚信息火箭，在一瞬间搜寻整个互联网，可以轻易破解任何安全密码，黑客任务轻而易举，难怪美国
		中央情报局对它特别感兴趣。
		光子
	光子计算机
		1990年初，美国贝尔实验室制成世界上第一台光子计算机。
		光子计算机是一种由光信号进行数字运算、逻辑操作、信息存贮和处理的新型计算机。光子计算机的基本组成部件是集成光路，要有激光器、透镜和核镜。由于光子比
		电子速度快，光子计算机的运行速度可高达一万亿次。它的存贮量是现代计算机的几万倍，还可以对语言、图形和手势进行识别与合成。
		许多国家都投入巨资进行光子计算机的研究。随着现代光学与计算机技术、微电子技术相结合，在不久的将来，光子计算机将成为人类普遍的工具。
	纳米
		纳米计算机是用纳米技术研发的新型高性能计算机。纳米管元件尺寸在几到几十纳米范围， 质地坚固，有着极强的导电性， 能代替硅芯片制造计算机。“纳米”是一个
		计量单位， 一个纳米等于10的（-9）次方米， 大约是氢原子直径的10倍。纳米技术是从20世纪80年代初迅速发展起来的新的前沿科研领域，最终目标是人类按照自己
		的意志直接操纵单个原子，制造出具有特定功能的产品。纳米技术正从微电子机械系统起步，把传感器、电动机和各种处理器都放在一个硅芯片上而构成一个系统。
		应用纳米技术研制的计算机内存芯片，其体积只有数百个原子大小，相当于人的头发丝直径的千分之一。纳米计算机不仅几乎不需要耗费任何能源， 而且其性能要比今天
		的计算机强大许多倍。
	生物
		20世纪80年代以来，生物工程学家对人脑、神经元和感受器的研究倾注了很大精力，以期研制出可以模拟人脑思维、低耗、高效的第六代计算机——生物计算机。
		用蛋白质制造的电脑芯片，存储量可以达到普通电脑的10亿倍。生物电脑元件的密度比大脑神经元的密度高100万倍，传递信息的速度也比人脑思维的速度快100万倍。
		其特点是可以实现分布式联想记忆．并能在一定程度上模拟人和动物的学习功能。它是一种有知识、会学习、能推理的计算机，具有能理解自然语言、声音、文字和图像
		的能力，并且具有说话的能力，使人机能够用自然语言直接对话，它可以利用已有的和不断学习到的知识，进行思维、联想、推理，并得出结论，能解决复杂问题，
		具有汇集、记忆、检索有关知识的能力。
